tutorials/reactingFoam/shearlayer/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingLeFoam;

startFrom       latestTime;

startTime       0;

stopAt          nextWrite;

endTime         1;

deltaT          1e-7;

writeControl    timeStep;//adjustableRunTime;

writeInterval   1000;

purgeWrite      10;

writeFormat     binary;

writePrecision  9;

writeCompression off;

timeFormat      general;

timePrecision   9;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo     0.7;

functions
{
}


libs
(
        "libchemistryModel_Aalto.so"
);


// ************************************************************************* //
